{"name":"Standard Half-Orc","description":"+2 to a single ability score\n+2 bonus to Intimidation\nDarkvision\nRemains conscious for 1 extra round after losing all hit points.","icon":"orc-head","is_enhanced":false,"is_official":false,"timestamps":{"created_t":1656563746,"last_update_t":1656563746},"source":"d20pfsrd","source_url":"https://www.d20pfsrd.com/races/core-races/half-orc/","extra_info":{"age":"15-26","age-adult":"14","background":"Staunchly independent, many half-orcs take to lives of adventure out of necessity, seeking to escape their painful pasts or improve their lot through force of arms. Others, more optimistic or desperate for acceptance, take up the mantle of crusaders in order to prove their worth to the world. Half-orcs raised in orc societies often take up the brutish ways of those around them, becoming fighters, barbarians, or rangers. Half-orcs who survive their shaman training may eventually succeed their masters as tribal shamans, or flee the tribe and practice their magic as outcasts or explorers.\n\nHalf-orcs are just as likely to have children that possess an innate talent for sorcery as any other race, with the abyssal, destined, and elemental (fire) bloodlines being the most common types of sorcerers. Half-orcs are fascinated by alchemy, and its destructive capabilities make its usefulness obvious in any orc tribe. Half-orc alchemists treat themselves as living experiments, even to the point of trying to separate their orc and human halves through alchemy. Other alchemists use their powers to enhance their physical abilities and thus increase their status within orc communities.\n\nIn human societies, half-orcs have a few more options. Many find it easy to take advantage of the brute strength and work as mercenaries or caravan guards. Crime is another easy route for half-orcs, as there are plenty of criminals looking for a strong arm. Half-orc clerics in human communities are fairly rare; the more religious half-orcs more often turn to (or get pushed to) the martial aspects of religious service and become paladins or inquisitors. Half-orcs usually lack the patience and money required to become a wizard.","genders":"Male or Female","height":"Male:   5'  -  6' 10\"\nFemale:   4' 7\"  -  6' 5\"","height-random":"Male: 4' 10\" then add 2d12 inches\nFemale: 4' 5\" then add 2d12 inches","names":"Male:  Ausk, Davor, Hakak, Kizziar, Makoa, Nesteruk, Tsadok.\nFemale:  Canan, Drogheda, Goruza, Mazon, Shirish, Tevaga, Zeljka.","weight":"Male: 164-318 lbs\nFemale: 124 - 278 lbs","weight-random":"Male: 150 + (2d12 x 7) lbs\nFemale: 110 + (2d12 x 7) lbs"},"change":{"on_enable":[{"itempath":"todo","set_id":"random()","set_value":{"description":"Add 2 to any one of the basic ability scores (Strength, Dexterity, Constitution, Intelligence, Charisma, or Wisdom).\nThis is a Half-Orc racial bonus.","icon":"upgrade","name":"Bonus Ability Score"}},{"itempath":"profile","set_id":"race","set_value":"half-orc"},{"itempath":"skills.intimidate","set_id":"half-orc","set_value":2},{"itempath":"todo","set_id":"random()","set_value":{"description":"Half-Orc Known Languages: Common, Orc\n\nFor each Intelligence modifier bonus, also learn one the following languages:\nAbyssal, Draconic, Giant, Gnoll, and  Goblin","icon":"talk","name":"Learn Languages"}},{"itempath":"todo","set_id":"random()","set_value":{"description":"Learn the Orc Ferocity ability (racial feat).","icon":"tied-scroll","name":"Learn Orc Ferocity"}},{"itempath":"todo","set_id":"random()","set_value":{"description":"Learn the Darkvision ability (racial feat)","icon":"angry-eyes","name":"Learn Darkvision"}}],"on_disable":null}}