{"name":"Cavalier","description":"While many warriors strive to perfect their art, spending all of their time honing their skill at martial arms, others spend as much effort dedicating themselves to a cause. These warriors, known as cavaliers, swear themselves to a purpose, serving it above all else. Cavaliers are skilled at fighting from horseback, and are often found charging across a battlefield, with the symbol of their order trailing on a long, fluttering banner. The cavalier’s true power comes from the conviction of his ideals, the oaths that he swears, and the challenges he makes.","icon":"horse-head","is_enhanced":false,"is_official":false,"timestamps":{"created_t":1655039276,"last_update_t":1655039276},"source":"d20PFSRD","source_url":"https://www.d20pfsrd.com/classes/base-classes/cavalier/","extra_info":{"alignment":"Any","role":"Cavaliers tend to marshal forces on the battlefield, using their mounted talents and challenges to control the flow of the fight. Outside of battle, cavaliers can be found advancing their cause through diplomacy and, if needed, subterfuge. The cavalier is no stranger to courtly intrigue and can hold his own in even the most delicate of social situations."},"change":{"on_enable":[{"itempath":"class","set_id":"cavalier","set_value":{"description":"While many warriors strive to perfect their art, spending all of their time honing their skill at martial arms, others spend as much effort dedicating themselves to a cause. These warriors, known as cavaliers, swear themselves to a purpose, serving it above all else. Cavaliers are skilled at fighting from horseback, and are often found charging across a battlefield, with the symbol of their order trailing on a long, fluttering banner. The cavalier’s true power comes from the conviction of his ideals, the oaths that he swears, and the challenges he makes.","hit_dice":{"dice_size":10},"icon":"horse-head","is_featured_class":true,"levels":{"current_level":0,"level_type":"Cavalier","object-progression":{"1":{"on_disable":null,"on_enable":[{"do_action":"skills.enable_class_skill()","set_value":["bluff","climb","craft_template","diplomacy","handle_animal","intimidate","profession_template","ride","sense_motive","swim"]},{"itempath":"stats.cav","set_id":"cavalier","set_value":"class.cavalier.level"},{"itempath":"stats.save_fort","set_id":"cavalier","set_value":{"index":["class.cavalier.level",-1],"table":[2,3,3,4,4,5,5,6,6,7,7,8,8,9,9,10,10,11,11,12]}},{"itempath":"stats.save_reflex","set_id":"cavalier","set_value":{"index":["class.cavalier.level",-1],"table":[0,0,1,1,1,2,2,2,3,3,3,4,4,4,5,5,5,6,6,6]}},{"itempath":"stats.save_will","set_id":"cavalier","set_value":{"index":["class.cavalier.level",-1],"table":[0,0,1,1,1,2,2,2,3,3,3,4,4,4,5,5,5,6,6,6]}}]}},"todo-progression":{"1":{"cko5m0x161moONeD":{"description":"Welcome, Cavalier! You've been issued 5d6x10 worth of gold to provision you for your journey.","icon":"coins","name":"Gain Gold"},"cko5myh1314w6olI":{"description":"You begin your adventure with clothing worth 10 gold or less.","icon":"shirt","name":"Starting Outfit"},"cko5t26ob8jkDARH":{"description":"Gain weapon proficiency: all Simple weapons and Martial weapons.\nGain armor proficiency: light armor, medium armor, and shields (but not tower shields).","icon":"swords-emblem","name":"Weapon and Armor Proficiency"},"cko5uxynfqpsrhts":{"description":"Once per day, you can Challenge a foe to combat.","icon":"shouting","name":"New Swift Action"},"cko5vu5n9csgGRBP":{"description":"Gain the Mount feat.","icon":"saddle","name":"New Class Feat"},"cko5zepe1xtsLyvf":{"description":"Choose a steed to carry you into battle.\nMedium-size Cavalier:\n - axebeak \n - camel\n - elk\n - giant seahorse\n - giant tortoise\n - horse\n - giraffe\n - zebra\nSmall-size Cavalier:\n - antelope\n - capybara\n - giant weasel\n - lizard (giant gecko)\n - kangaroo\n - pony\n - ram\n - reindeer\n - stag\n - wolf\n - wolfdog","icon":"horseshoe","name":"New Animal Companion"},"cko60seywclcOIrn":{"description":"New Cavaliers must pledge with a specific Order.","icon":"cross-shield","name":"Pledge to an Order"},"cko61q812vlsCL0g":{"description":"You gain the teamwork feat!","icon":"team-upgrade","name":"Gain Feat"}},"11":{"cko6b46s65s0ee3K":{"description":"You learn to make devastating charge attacks while mounted. Double the threat range of any weapons wielded during a charge while mounted. This increase does not stack with other effects that increase the threat range of the weapon. In addition, you can make a free bull rush, disarm, sunder, or trip combat maneuver if your charge attack is successful. This free combat maneuver does not provoke an attack of opportunity.","icon":"running-ninja","name":"Mighty Charge"}},"12":{"cko6c0ku7v5sMRkd":{"description":"Whenever you declare a challenge, the target must pay attention to the threat you pose. As long as the target is within the threatened area of the cavalier, it takes a –2 penalty to its AC from attacks made by anyone other than the cavalier.","icon":"shouting","name":"Demanding Challenge"}},"14":{"cko6csbhajr43nfG":{"description":"Your banner becomes a rallying call to your allies. All allies within 60 feet receive a +2 morale bonus on saving throws against charm and compulsion spells and effects. In addition, while your banner is displayed, the cavalier can spend a standard action to wave the banner through the air, granting all allies within 60 feet an additional saving throw against any one spell or effect that is targeting them. This save is made at the original DC. Spells and effects that do not allow saving throws are unaffected by this ability. An ally cannot benefit from this ability more than once per day.","icon":"flying-flag","name":"Greater Banner"}},"17":{"cko6dmzc4yyoz7dc":{"description":"You receive an additional teamwork feat as a bonus feat. You must meet the prerequisites for this feat. The cavalier can grant this feat to his allies using the tactician ability. Whenever the cavalier uses the tactician ability, he grants any two teamwork feats that he knows. He can select from any of his teamwork feats, not just his bonus feats.","icon":"chess-knight","name":"Master Tactician"}},"20":{"cko6ere1ugxsTY7A":{"description":"Choose to learn either the Supreme Charge or Tactical Genius abilities.","icon":"think","name":"Capstone Ability"}},"3":{"cko6415llkowdacQ":{"description":"You receive a +4 bonus on melee attack rolls on a charge while mounted. This replaces the previous +2 bonus.\nAdditionally, you no longer suffer any penalties to your AC after making a charge attack while mounted.","icon":"cavalry","name":"Cavalier's Charge"}},"4":{"cko65q7ahqio3JM1":{"description":"You learn to train mounts with speed and unsurpassed expertise. Receive a bonus equal to 1/2 your cavalier level whenever using Handle Animal on an animal that serves as a mount.\nIn addition, reduce the time needed to teach a mount a new trick or train a mount for a general purpose to 1 day per 1 week required by increasing the DC by +5. You can also train more than one mount at once, although each mount after the first adds +2 to the DC.","icon":"whip","name":"Expert Trainer"}},"5":{"cko672bgskjk1YJF":{"description":"Your banner becomes a symbol of inspiration to allies and companions. As long as your banner is clearly visible, all allies within 60 feet receive a +2 morale bonus on saving throws against fear and a +1 morale bonus on attack rolls made as part of a charge. At 10th level, and every five levels thereafter, these bonuses increase by +1. The banner must be at least Small or larger and must be carried or displayed by the cavalier or his mount to function.","icon":"flying-flag","name":"Banner"}},"6":{"cko68vfl4ohstvrw":{"description":"Starting at level 6 and continuing every 6 levels, gain a bonus feat in addition to those gained from normal advancement. You must select this bonus feat from the available combat feats and must meet the prerequisites.","icon":"swords-power","name":"Bonus Feat"}},"9":{"cko6ab0h5bcwty4u":{"description":"You receive an additional teamwork feat as a bonus feat. You must meet the prerequisites for this feat. The cavalier can grant this feat to his allies using the tactician ability. Using the tactician ability is a swift action.","icon":"black-flag","name":"Greater Tactician"}}}},"name":"Cavalier","skill_points_per_level":[4,"stats.int.mod()"]}}],"on_disable":null}}